## ***Prueba Técnica – Análisis y Procesamiento de Datos de Ventas***
**Vacante:** Analista de Sección Evolución Operación Financiación (Junior)  
**Autor:** Luis Alejandro Londoño Martínez  
**Fecha:** 12-11-2025

### ***Librerías***

In [ ]:
import pandas as pd
from pathlib import Path

### ***Carga de datos***

In [10]:
ruta = "datos_ventas.xlsx"
datos_ventas_df = pd.read_excel(ruta)
datos_ventas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID_Venta         100 non-null    int64
 1   Fecha            100 non-null    object
 2   Producto         100 non-null    object
 3   Cantidad         100 non-null    int64
 4   Precio_Unitario  100 non-null    int64
 5   Total_Venta      75 non-null     float64
 6   Vendedor         100 non-null    object
 7   ID_Cruce         100 non-null    int64
dtypes: float64(1), int64(4), object(3)
memory usage: 6.4+ KB

In [ ]:
# Cantidad general de registros
len(datos_ventas_df)

100

In [11]:
datos_ventas_df.sample(6)

,ID_Venta,Fecha,Producto,Cantidad,Precio_Unitario,Total_Venta,Vendedor,ID_Cruce
62,63,2023-05-25,Monitor,2,1151,2302.0,Carlos,163
50,51,2023-12-14,Mouse,7,278,NaN,Carlos,151
46,47,2023-03-11,Laptop,9,619,5571.0,Beatriz,147
26,27,2023-03-21,Laptop,5,228,1140.0,Ana,127
98,99,2023-12-21,Laptop,4,1885,7540.0,Carlos,199
30,31,2023-06-07,Teclado,6,894,5364.0,Carlos,131

In [13]:
# Selección de columnas de interés para la prueba
columnas = [
    "ID_Venta", "Fecha", "Producto",
    "Cantidad", "Precio_Unitario",
    "Total_Venta", "Vendedor"
]

datos_ventas_df = datos_ventas_df[columnas].copy()

# También hubiera sido posible solo eliminar la columna "ID_Cruce" ya que es la única no relevante

In [15]:
datos_ventas_df.sample(6)

,ID_Venta,Fecha,Producto,Cantidad,Precio_Unitario,Total_Venta,Vendedor
8,9,2023-08-16,Impresora,7,827,5789.0,Carlos
73,74,2023-09-11,Monitor,10,784,7840.0,Beatriz
41,42,2023-02-19,Impresora,5,1459,NaN,David
11,12,2023-06-15,Mouse,7,1376,9632.0,Carlos
99,100,2023-01-27,Tablet,8,1371,10968.0,Carlos
68,69,2023-09-17,Teclado,3,1474,4422.0,Ana